<?php
/**
 * Файл был сгенерирован с помощю Geany Qm Framework
 * Необходимо провести реорганизацию кода даного класса.
 *
 * Все файлы классов в каталоге "Classes" должны отвечать некоторым требованим
 * 1. Имя файла и имя класса должны быть одинаковы. Если вы укжите автозагрузку для
 * класса поиск пройдет успешно и класс запустится. Если Вы не собераетесь ключать
 * файл в авто загрузку называть можете как угодно, но для таких случаем можно создавать другие
 * каталоги и не отступать от общей архитектуры.
 * 2. Класс может использывать общие константы и функции, но неможет использывать методы контролера или модели
 * 3. Связь меджу классами не стойкая и наследывать классы нерекомендуеться. Выходом есть создание внутри
 * каталога и помещенеи в него необходимых классов с последующим подключением и наследыванием.
 */

class QmClasses

    public $someVar;

    public function __construct() {
        # ...Code
    }

}