<div class="win">
    <div class="btnClose">Console Close</div>
    <div class="winHeader">
        <h3>Lock copy in page</h3>
    </div>
    <div class="winContent">
        <p>
        Часто во время добавления или обновления строки нам требуется проверить, соответствуют ли значения полей некоторым правилам. Особенно это важно в случае, если данные поступают со стороны клиента. В подавляющем большинстве случаев таким данным доверять нельзя.
        </p>

        <p>
        AR осуществляет проверку данных автоматически в момент вызова метода save(). Проверка основана на правилах, заданных в методе AR-класса rules(). Детально ознакомиться с тем, как задаются правила проверки, можно в разделе Определение правил проверки. Ниже приведён типичный порядок обработки в момент сохранения записи:
        </p>
        <p>
            Часто во время добавления или обновления строки нам требуется проверить, соответствуют ли значения полей некоторым правилам. Особенно это важно в случае, если данные поступают со стороны клиента. В подавляющем большинстве случаев таким данным доверять нельзя.
        </p>

        <p>
            AR осуществляет проверку данных автоматически в момент вызова метода save(). Проверка основана на правилах, заданных в методе AR-класса rules(). Детально ознакомиться с тем, как задаются правила проверки, можно в разделе Определение правил проверки. Ниже приведён типичный порядок обработки в момент сохранения записи:
        </p>
    </div>

</div>