


<p>
<b>Quick Minimalism</b> - это PHP-фреймворк для создания сайтов и разработки разнообразных веб-приложений. <b>Quick Minimalism</b> предоставляет готовые инструменты для авторизации пользователей, регулирования прав доступа, маршрутизации, CSS-инструментарий для быстрого создания выразительных веб-интерфейсов и много другое. Фреймворк прекрасно подходит для разработки веб-приложений для бизнеса и командного использования.
</p>

<p>
Лежит в основе многих популярных веб-приложений. Например, Shop-Script 5.
</p>

<p>
Работает на основе PHP, MySQL, Smarty и jQuery.
</p>


<h2>Стстемные требования.</h2>
<p>
Фреймворк прекрасно подходит для разработки веб-приложений для бизнеса и командного использования.
</p>

<h2 class="btn_blue"><a href="/?link">Скачать</a></h2>

<p>
Фреймворк прекрасно подходит для разработки веб-приложений для бизнеса и командного использования.
</p>
<h2 class="btn_black"><a href="/?link">Пример преложения</a></h2>

<h2>Что внутри.</h2>
<p>
Лежит в основе многих популярных веб-приложений. Например, CSS-инструментарий для быстрого создания выразительных веб-интерфейсов и много другое.
</p>
<div class="">
<pre><code>
[app]               Установленные приложения
··· [Classes]       Дополнительные расширения <a href="#">Детальней</a>.
··· ··· Qm.php      Класс Расширения, всегда включен в дистрибютив <a href="#">Что в нем</a> и <a href="#">другие</a>.
··· [Controllers]   Директория контролеров (логика). <a href="#">В документацию</a>.
··· [Models]        Директория моделей (работа с БД). <a href="#">В документацию</a>.
··· [Views]         Виды преложения. <a href="#">Работа с видами</a>.
[css]
[fonts]
[img]
[js]
[lib]               системная часть (ядро) фреймворка <a href="#">link</a>
··· [database]      кталог с файлами базы-данных SQLite и Файловой БД
··· [generator]     генератор кода
··· App.php         ooo
··· ClLoader.php    ooo
··· Controller.php  ooo
··· Model.php       ooo
··· DataBase.php    ooo
··· config.php      ooo
··· functions.php   ooo
[theme]             шаблоны layout
··· [qmTheme]
index.php           прием и разбор всех HTTP-запросов

</code></pre>
</div>

<h2>Разработка.</h2>
<p>
Например, Лежит в основе многих популярных CSS-инструментарий для быстрого создания выразительных веб-интерфейсов и много другое.
</p>