<?php

return array(

	'name'  => 'Русский',
	'code'  => 'ru',
	'image' => 'ru_flag.png',
	'words' => array(
	
/* System options
 ********************************************* */
	    'ERROR' => 'Ошибка!',
        'ERROR404' => 'Запрашиваемая страница не найдена!',
        'REDIRECT' => 'Переадрисация!',
        'REDIRECT_MSG' => 'Сейчас Вы будите перенаправлены, если этого не произошло перейдите по <a href="/index">ссылке</a>.',

	
/* Custom option
 ********************************************* */


	)
);