<p>Generator - это небольшей конструктор кода для вашего преложения. Все что делает Generator это интим,
    ибо производимый им файл являеться лишь каркасом с возможными свойстами и методами
    которые разработчик может использывать. Generator позволяет создать базовую структуру
    вашего нового приложения или базовый контролер или модель.</p>

<p>Использывать конструктор Generator совсем не обезательно. Вы можете вручную создавать
    все что необходимо в приложении. Генератор может скоротиль на несколько минут
    первоначальный этап разработки.</p>